#include <iostream>
#include <cmath>
using namespace std;

int main() {
    setlocale(LC_ALL, "RUS");
    int a, b , c;
    cout << "Введите длину первой стороны треугольника: " << "\n";
    cin >> a;
    cout << "Введите длину второй стороны треугольника: " << "\n";
    cin >> b;
    cout << "Введите длину третьей стороны треугольника: " << "\n";
    cin >> c;
    double P = a + b + c;
    if ((a + b > c) && (a + c > b) && (b + c > a)) {
        cout << "Периметр треугольника равен: " << P << "\n";
        double S = sqrt((P / 2) *(P / 2 - a) * (P / 2 - b) * (P / 2 - c));
        cout << "Площадь треугольника по формуле Герона равна: " << S << "\n";
        if (a == b && a == c && b == c) {
            cout << "Треугольник равнобедренный\n";
        } else {
            cout << "Треугольник неравнобедренный\n";
        }
    } else {
        cout << "Такой треугольник не может существовать!";
    }

    return 0;
}
